app/Controllers/Mahasiswa.php

SELECT *
FROM `mahasiswa`
---
    public function index()
    {

        $katakunci = $this->request->getGet('katakunci');
        if ($katakunci) {
            $pencarian = $this->MahasiswaModel->cari($katakunci);
        } else {
            $pencarian = $this->MahasiswaModel;
        }


        $Mahasiswa = $this->MahasiswaModel->findAll();

SELECT *
FROM `mahasiswa`
WHERE `mahasiswa`.`id` = '2'
---
    public function detail($id)
    {
        $mahasiswa = $this->MahasiswaModel->find($id);